src/main/resources/xml/trainingServer/updateRental.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:my="my-namespace">
   <soapenv:Header/>
   <soapenv:Body>
      <my:updateRentalRequest>
         <my:rental_id></my:rental_id>
         <my:customer_id></my:customer_id>
         <my:staff_id></my:staff_id>
         <my:inventory_id></my:inventory_id>
         <my:rental_date></my:rental_date>
         <my:return_date></my:return_date>
      </my:updateRentalRequest>
   </soapenv:Body>
</soapenv:Envelope>
